// Задача 20. Гра в кості. Правила гри:
// 1) користувач може кинути кості не більше двох разів 
// (користувач сам вирішує чи робити, чи не робити другий кидок);
// 2) якщо випадає парне число, то кількість балів збільшується на це число;
// 3) якщо випадає непарне число, то кількість балів зменшується на це число;
// 4) виграє той, у кого кількість балів більша.

const firstPlayer =  Math.ceil(Math.random() * 6)
console.log('First Player', firstPlayer)
if(firstPlayer >= 0 || firstPlayer > 6 )
{
    
}