// 13.	Дано масив розмірності N. 
// Назвемо серією групу однакових елементів що йдуть поспіль, 
// а довжиною серії - кількість цих елементів (довжина серії може дорівнювати = 0. 
//  Додати після кожної серії елемент з текстом «серія k», де k – порядковой номер серії

// якщо в тебе був масив const array = [2, 2, 9, 105, 1, 1, 1, 2, 3, 3, 4, 4, 17, 98, 98, 99, 105, 105];
// то має бути масив [
//     2,         2,         'seria 1',
//     9,         105,       1,
//     1,         1,         'seria 2',
//     2,         3,         3,
//     'seria 3', 4,         4,
//     'seria 4', 17,        98,
//     98,        'seria 5', 99,
//     105,       105,       'seria 6'
//   ]

let array = [2, 2, 9, 105, 1, 1, 1, 2, 3, 3, 4, 4, 17, 98, 98, 99, 105, 105]  //масив розмірності N. 
// let final = [2,2,'seria 1',9,105,1,1,1,'seria 2',2,3,3,'seria 3',4,4,'seria 4', 17, 98,98, 'seria 5', 99,105,  105, 'seria 6']
let newArray = []
for (let i = 0, k = 0, l = 1; i < array.length; i++, k++) {
    /////////////////////////////////|i=0 j=1 k = 0 l = 1  |
    newArray[k] = array[i]         //|

    if ((array[i] === array[i - 1]) && (array[i] !== array[i + 1])) {
        k++                        //|                                                      
        newArray[k] = `Серія № ${l}`                             
        l++                        //| 

    }
    console.log(`newArray[k]= ${newArray[k]}`)
}
console.log(`newArray = ${newArray}`)  







// for (let i = 0, j = i + 1, k = 0, l = 1; i < array.length; i++, j++, k++) {
//     /////////////////////////////////|i=0 j=1 k = 0 l = 1  |i=2 j=3 k = 3 l = 2 |i=3 j=4 k = 4 l = 2  |i=4 j=5 k = 5 l = 2 |i=5 j=6 k = 6 l = 2   |i=7 j=8 k = 9 l = 3  |i=8 j=9 k = 10 l = 3
//     newArray[k] = array[i]         //|k = 0  / 2           | k = 3  / 9         | k = 4  / 105        | k = 5  / 1         | k = 6  / 1           |k = 9  / 2           |k = 10  / 3
//     let number = `Серія № ${l}`

//     if ((array[i] === array[j]) && (array[j] !== array[j + 1])) {
//         k++                        //| k = 1               |                    |                     |                    | k = 7
//         newArray[k] = array[i]     //| k = 1 / 2           |                    |                     |                    | k = 7 / 1
//         k++                        //| k = 2               |                    |                     |                    |k = 8
//         newArray[k] = number       //| k = 2 / Cерія 1     |                    |                     |                    |k = 8 /Cерія 2
//         l++                        //| l = 2               |                    |                     |                    |l = 3
//         i++                        //| i = 1               |                    |                     |                    |i=6
//         j++                        //| j = 2               |                    |                     |                    |j=7
//     }

//     console.log(`newArray[k]= ${newArray[k]}`)
// }
// console.log(`newArray = ${newArray}`)  // 













