// 5.1 Дано масив розмірності N. 
// Назвемо серією групу однакових елементів що йдуть поспіль, 
// а довжиною серії - кількість цих елементів 
// (довжина серії може дорівнювати 0. Вивести масив, що містить довжини всіх серій вихідного масиву. 

let number = [1, 1, 2, 3, 3, 3, 3, 4, 5, 6, 6, 2, 2, 1]

let series = []          //група однакових елементів що йдуть поспіль
// let seriesLength = []  // довжина серії- кількість елементів в серії

for (let i = 0; i < number.length; i++) {      // i = 0     
    // for (let j = 0; j < number.length; j++)   

    if (number[i] === number[i + 1]) {               
        series[i] = [ ]   
       alert(`${ }`)                 
                    
    }
    else{                                                  
                                 
                     
    }

    // document.write(`${seriesLength}`)

}