
// 11.Дано числовий масив розмірності N. 
//  Вважати, що його елементи утворюють числову послідовність, 
//  утворити новий масив що містить найдовшу зростаючу підпослідовність
// 5, 10, 6, 12, 3, 24, 7, 8


let array = [5, 10, 6, 12, 3, 24, 7, 8] // числовий масив розмірності N. 
let newArray = []
let maxNumber;


for (let i = 0; i < array.length; i++) { // i = 0                                    i = 1 
    newArray[k] = array[i] //k = 0 / 5
    maxNumber = array[i]   // 5
    for (let j = i + 1, k = 0; j < array.length; j++) { // j = 1 k = 0  | j = 2 k = 1 |j = 3 k = 1  |j = 4 k = 2 | j = 5 k = 2 |j = 6 k = 3 |j = 7 k = 3
        if (array[j] > maxNumber) {             // [10] > [5]           |[6] > [10] - |[12] > [10]  |[3] > [12]  |[24] > [12]  |[7] > [24]  |[8] > [24] 
            maxNumber = array[j]               // maxNumber[10]         |maxN[10]     |maxN[12]     |maxN[12]    |maxN[24]     |maxN[24]    |maxN[24] 
            k++                                // k = 1                 |-            |k = 2        |-           |k = 3        |-           |-
            newArray[k] = array[j]            // k = 1 / 10             |-            |k = 2 /12    |-           |k = 3/24     |-           |-
        }
//if(кінець масива ){j+1  }
    }

    //[5,10,12,24 ]
    //[10,12,24] 
    //[6,12,24]
    //[12,24]
    //[3]
    //[24]
    //[7,8]
     //[8]
}







// for (let i = 0; i < array.length; i++) { // i = 0                                    i = 1 
//     newArray[k] = array[i] //k = 0 / 5
//     maxNumber = array[i]   // 5
//     for (let j = i + 1, k = 0; j < array.length; j++) { // j = 1 k = 0  | j = 2 k = 1 |j = 3 k = 1  |j = 4 k = 2 | j = 5 k = 2 |j = 6 k = 3 |j = 7 k = 3
//         if (array[j] > maxNumber) {             // [10] > [5]           |[6] > [10] - |[12] > [10]  |[3] > [12]  |[24] > [12]  |[7] > [24]  |[8] > [24] 
//             maxNumber = array[j]               // maxNumber[10]         |maxN[10]     |maxN[12]     |maxN[12]    |maxN[24]     |maxN[24]    |maxN[24] 
//             k++                                // k = 1                 |-            |k = 2        |-           |k = 3        |-           |-
//             newArray[k] = array[j]            // k = 1 / 10             |-            |k = 2 /12    |-           |k = 3/24     |-           |-
//         }
// //if(кінець масива ){j+1  }
//     }

//     //[5,10,12,24 ]
//     //[10,12,24] 
//     //[6,12,24]
//     //[12,24]
//     //[3]
//     //[24]
//     //[7,8]
//      //[8]
// }