// 33. Танчики. На полі з 10 клітинок розміщують танк. 
// За один крок танк може переміщуватися на відстань від 0 до 1 у  будь-якому напрямку (в межах поля). 
// При влучанні броня танка пошкоджується на 30 балів (всього 100).
// Гра продовжується поки або не закінчаться снаряди (кількість вводиться з клавіатури) або не буде влучання. 
// Спробуйте відоразити гру графічно.



let field = 10


document.write('<table border="2"> ')
document.write("<tr>");
for (let i = 0; i < field; i++) {
    document.write(`<td id = ${i + 1}>   </td>`);
    console.log(' i ', i + 1)
}
document.write("</tr>");
document.write("</table>");
alert(`Start Game`)


